a = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}
my_list = ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
while True:
    n = input("Число от 1 до 12: ")
    if n.isdigit():
        n = int(n)
        if 1 < n < 12:
            print(a.get(n))
            print(my_list[n - 1])
            break
        else:
            print("Это число не подходит")
            continue
    else:
        print("Это значение не подходит")
        continue
